data/Parm_PH_29/alpha_10/alpha_10_6000_4048/0/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
15600
(
(0.027533067843108 1.00195544733151 0)
(0.0825992000907869 1.00195488366535 0)
(0.137645601849956 1.00079174802999 1.73571244188863e-18)
(0.192516142051959 0.996530632836499 0)
(0.246808160427377 0.987732063851907 6.83206577150224e-18)
(0.299831945679533 0.973262882318487 1.79114930725362e-18)
(0.350819668114647 0.952742252468112 -9.53960243211053e-20)
(0.399463645406047 0.92706590456244 -1.88675584088099e-18)
...
)
;

boundaryField
{
    bottomWall
    {
        type            calculated;
        value           nonuniform List<vector> 
120
(
(0.0275380308287193 1 0)
(0.0826140843252403 0.999999435229031 0)
(0.137660661570098 0.998834429392629 0)
(0.192524645276771 0.994567469357484 0)
(0.246803698512525 0.985758700166011 0)
(0.299808778286068 0.971275266224766 0)
(0.350775555173464 0.950734915615479 0)
(0.399401814158756 0.925027846371397 0)
...
)
;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<vector> 
120
(
(0.025 4.048 0)
(0.075 4.048 0)
(0.125 4.048 0)
(0.175 4.048 0)
(0.225 4.048 0)
(0.275 4.048 0)
(0.325 4.048 0)
(0.375 4.048 0)
...
)
;
    }
    inlet_half0
    {
        type            cyclic;
    }
    inlet_half1
    {
        type            cyclic;
    }
    outlet_half0
    {
        type            cyclic;
    }
    outlet_half1
    {
        type            cyclic;
    }
    sideRight_half0
    {
        type            empty;
    }
    sideRight_half1
    {
        type            empty;
    }
    sideLeft_half0
    {
        type            empty;
    }
    sideLeft_half1
    {
        type            empty;
    }
}


// ************************************************************************* //
