data/Parm_PH_29/alpha_10/alpha_10_6000_4048/0/U_LES
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U_LES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector>
15600
(
(0.08342349 -0.00021667 0.00000000)
(0.08690185 -0.00035215 0.00000000)
(0.07863203 -0.00055288 0.00000000)
(0.03589300 -0.00048724 0.00000000)
(0.00880806 -0.00070225 0.00000000)
(-0.00215249 0.00047368 0.00000000)
(-0.00516727 0.00251955 0.00000000)
(-0.00546394 0.00313616 0.00000000)
...
)
;

boundaryField
{
    bottomWall
    {
        type        fixedValue;
        value       uniform (0 0 0);
    }
    topWall
    {
        type        fixedValue;
        value       uniform (0 0 0);
    }
    inlet_half0
    {
        type        cyclic;
    }
    inlet_half1
    {
        type        cyclic;
    }
    outlet_half0
    {
        type        cyclic;
    }
    outlet_half1
    {
        type        cyclic;
    }
    sideRight_half0
    {
        type        empty;
    }
    sideRight_half1
    {
        type        empty;
    }
    sideLeft_half0
    {
        type        empty;
    }
    sideLeft_half1
    {
        type        empty;
    }
}

// ************************************************************************* //
