data/Parm_PH_29/alpha_10/alpha_10_6000_4048/0/tauij_LES
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      tauij_LES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<symmTensor>
15600
(
(0.00628561 -0.00012935 0.00000000 0.00004395 0.00000000 0.00396784)
(0.00647648 -0.00012985 0.00000000 0.00004480 0.00000000 0.00393889)
(0.00542278 -0.00010142 0.00000000 0.00002856 0.00000000 0.00308179)
(0.00184093 -0.00000997 0.00000000 -0.00000550 0.00000000 0.00085167)
(0.00037183 0.00001902 0.00000000 -0.00001436 0.00000000 0.00046242)
(0.00026465 -0.00004289 0.00000000 0.00001096 0.00000000 0.00056759)
(0.00032795 -0.00017398 0.00000000 0.00009397 0.00000000 0.00089762)
(0.00047874 -0.00029656 0.00000000 0.00018868 0.00000000 0.00089184)
...
)
;

boundaryField
{
    bottomWall
    {
        type        fixedValue;
        value       uniform (0 0 0 0 0 0);
    }
    topWall
    {
        type        fixedValue;
        value       uniform (0 0 0 0 0 0);
    }
    inlet_half0
    {
        type        cyclic;
    }
    inlet_half1
    {
        type        cyclic;
    }
    outlet_half0
    {
        type        cyclic;
    }
    outlet_half1
    {
        type        cyclic;
    }
    sideRight_half0
    {
        type        empty;
    }
    sideRight_half1
    {
        type        empty;
    }
    sideLeft_half0
    {
        type        empty;
    }
    sideLeft_half1
    {
        type        empty;
    }
}

// ************************************************************************* //
